{"vocab_to_idx": {"the": 1, "of": 2, "to": 3, "in": 4, "is": 5, "and": 6, "we": 7, "for": 8, "that": 9, "this": 10, "learning": 11, "an": 12, "which": 13, "maxq": 14, "can": 15, "paper": 16, "it": 17, "decision": 18, "method": 19, "be": 20, "by": 21, "with": 22, "on": 23, "function": 24, "state": 25, "policy": 26, "as": 27, "are": 28, "order": 29, "from": 30, "hierarchical": 31, "performance": 32, "classifier": 33, "data": 34, "approach": 35, "target": 36, "value": 37, "conditions": 38, "domains": 39, "show": 40, "analysis": 41, "algorithms": 42, "complexity": 43, "case": 44, "hybrid": 45, "induction": 46, "inductive": 47, "logic": 48, "programming": 49, "tilde": 50, "ilp": 51, "its": 52, "abstractions": 53, "algorithm": 54, "experimentally": 55, "important": 56, "actions": 57, "under": 58, "cost": 59, "such": 60, "class": 61, "robust": 62, "clustering": 63, "trees": 64, "system": 65, "tree": 66, "examples": 67, "setting": 68, "reinforcement": 69, "based": 70, "functions": 71, "five": 72, "converges": 73, "optimal": 74, "known": 75, "abstraction": 76, "representation": 77, "has": 78, "makes": 79, "non": 80, "comparison": 81, "many": 82, "perform": 83, "developed": 84, "these": 85, "dynamics": 86, "constructed": 87, "thus": 88, "natural": 89, "one": 90, "reference": 91, "kolmogorov": 92, "well": 93, "may": 94, "available": 95, "computers": 96, "real": 97, "efficient": 98, "techniques": 99, "computational": 100, "top": 101, "down": 102, "tic": 103, "propositional": 104, "two": 105, "memory": 106, "agent": 107, "partially": 108, "observable": 109, "cross": 110, "validation": 111, "presents": 112, "decomposing": 113, "process": 114, "mdp": 115, "into": 116, "hierarchy": 117, "smaller": 118, "mdps": 119, "proves": 120, "results": 121, "power": 122, "use": 123, "recursively": 124, "even": 125, "experiments": 126, "possible": 127, "finally": 128, "related": 129, "work": 130, "rl": 131, "defined": 132, "however": 133, "space": 134, "define": 135, "multiplicative": 136, "newton": 137, "like": 138, "situation": 139, "where": 140, "restricted": 141, "orthogonal": 142, "group": 143, "general": 144, "framework": 145, "restriction": 146, "problem": 147, "second": 148, "new": 149, "convergence": 150, "scaling": 151, "each": 152, "other": 153, "coset": 154, "point": 155, "any": 156, "computer": 157, "all": 158, "binary": 159, "strings": 160, "standard": 161, "only": 162, "they": 163, "not": 164, "depend": 165, "more": 166, "useful": 167, "if": 168, "include": 169, "calculus": 170, "example": 171, "some": 172, "world": 173, "usually": 174, "misclassification": 175, "costs": 176, "systems": 177, "build": 178, "best": 179, "extends": 180, "including": 181, "also": 182, "roc": 183, "adapts": 184, "allows": 185, "clear": 186, "empirical": 187, "indeed": 188, "problems": 189, "presented": 190, "aim": 191, "employs": 192, "first": 193, "logical": 194, "relational": 195, "expressive": 196, "efficiency": 197, "sets": 198, "handled": 199, "within": 200, "mining": 201, "main": 202, "assumption": 203, "interpretations": 204, "up": 205, "existing": 206, "classical": 207, "large": 208, "implementations": 209, "loads": 210, "lds": 211, "compare": 212, "explore": 213, "external": 214, "technique": 215, "overhead": 216, "markov": 217, "additive": 218, "combination": 219, "defines": 220, "formal": 221, "representational": 222, "establishes": 223, "safe": 224, "online": 225, "model": 226, "free": 227, "wih": 228, "probability": 229, "kind": 230, "locally": 231, "presence": 232, "kinds": 233, "evaluates": 234, "through": 235, "series": 236, "three": 237, "shows": 238, "much": 239, "faster": 240, "than": 241, "flat": 242, "fact": 243, "learns": 244, "benefit": 245, "compute": 246, "execute": 247, "improved": 248, "via": 249, "procedure": 250, "similar": 251, "improvement": 252, "step": 253, "iteration": 254, "demonstrates": 255, "effectiveness": 256, "execution": 257, "concludes": 258, "discussion": 259, "design": 260, "tradeoffs": 261, "researchers": 262, "have": 263, "explored": 264, "methods": 265, "temporal": 266, "abstract": 267, "primitive": 268, "before": 269, "terminating": 270, "little": 271, "about": 272, "aspects": 273, "ignored": 274, "previous": 275, "combined": 276, "decomposition": 277, "prove": 278, "successful": 279, "application": 280, "author": 281, "et": 282, "al": 283, "extended": 284, "without": 285, "specifying": 286, "though": 287, "groups": 288, "somewhat": 289, "complicated": 290, "explicit": 291, "expression": 292, "amount": 293, "individual": 294, "jumps": 295, "obtained": 296, "exactly": 297, "convergent": 298, "global": 299, "instability": 300, "inherent": 301, "remedied": 302, "levenberg": 303, "marquardt": 304, "type": 305, "variation": 306, "readily": 307, "applied": 308, "independent": 309, "component": 310, "remarkable": 311, "illustrated": 312, "numerical": 313, "simulation": 314, "construct": 315, "scratch": 316, "fourth": 317, "cumulant": 318, "stochastic": 319, "variables": 320, "updating": 321, "rule": 322, "here": 323, "homogeneous": 324, "nature": 325, "lie": 326, "numerous": 327, "merits": 328, "rigorous": 329, "treatment": 330, "consequence": 331, "shown": 332, "invariant": 333, "componentwise": 334, "choosen": 335, "identifying": 336, "points": 337, "transformed": 338, "assume": 339, "our": 340, "move": 341, "toward": 342, "direction": 343, "no": 344, "prewhitening": 345, "required": 346, "given": 347, "asymptotic": 348, "properties": 349, "considered": 350, "because": 351, "do": 352, "argue": 353, "refined": 354, "practical": 355, "simple": 356, "restrict": 357, "interesting": 358, "way": 359, "modeling": 360, "life": 361, "limited": 362, "physically": 363, "us": 364, "give": 365, "what": 366, "might": 367, "look": 368, "mathematically": 369, "restrictions": 370, "error": 371, "terms": 372, "logarithmic": 373, "disappear": 374, "keywords": 375, "algorithmic": 376, "information": 377, "theory": 378, "environments": 379, "difficult": 380, "specify": 381, "operating": 382, "precisely": 383, "uncertainty": 384, "building": 385, "classification": 386, "problematic": 387, "will": 388, "at": 389, "least": 390, "cases": 391, "actually": 392, "surpass": 393, "across": 394, "wide": 395, "variety": 396, "frameworks": 397, "optimization": 398, "metrics": 399, "accuracy": 400, "expected": 401, "lift": 402, "precision": 403, "recall": 404, "workforce": 405, "utilization": 406, "store": 407, "update": 408, "imprecise": 409, "distributions": 410, "convex": 411, "hull": 412, "rocch": 413, "combines": 414, "geometry": 415, "them": 416, "particulars": 417, "analyzing": 418, "learned": 419, "classifiers": 420, "incremental": 421, "minimizes": 422, "management": 423, "visual": 424, "comparisons": 425, "sensitivity": 426, "analyses": 427, "evidence": 428, "needed": 429, "basic": 430, "towards": 431, "principles": 432, "instance": 433, "resulting": 434, "methodology": 435, "implemented": 436, "various": 437, "both": 438, "when": 439, "comparing": 440, "attribute": 441, "there": 442, "trade": 443, "off": 444, "between": 445, "typically": 446, "but": 447, "less": 448, "therefore": 449, "current": 450, "small": 451, "according": 452, "standards": 453, "community": 454, "source": 455, "inefficiency": 456, "lies": 457, "several": 458, "so": 459, "cannot": 460, "independently": 461, "unnecessary": 462, "scale": 463, "explain": 464, "context": 465, "databases": 466, "relate": 467, "corresponds": 468, "multiple": 469, "relations": 470, "expressiveness": 471, "while": 472, "maintaining": 473, "extent": 474, "study": 475, "present": 476, "alternative": 477, "classic": 478, "showing": 479, "handle": 480, "or": 481, "mb": 482, "scales": 483, "linearly": 484, "number": 485, "necessary": 486, "history": 487, "observations": 488, "stigmergic": 489, "ability": 490, "set": 491, "bits": 492, "included": 493, "part": 494, "input": 495, "need": 496, "learn": 497, "reactive": 498, "highly": 499, "markovian": 500, "domain": 501, "sarsa": 502, "lambda": 503, "had": 504, "success": 505, "vaps": 506, "due": 507, "baird": 508, "moore": 509, "guarantees": 510, "benchmark": 511, "generally": 512, "applicable": 513, "often": 514, "employed": 515, "machine": 516, "disadvantage": 517, "straightforward": 518, "implementation": 519, "reduced": 520, "significantly": 521, "integrating": 522, "normal": 523, "discuss": 524, "how": 525, "adapted": 526, "provide": 527, "speedups": 528, "adaptations": 529, "yield": 530, "supported": 531, "experimental": 532, "<UNK>": 0}, "vocab_size": 533, "total_words": 1386}